'''
Написать программу, которая должна определить город по почтовому индексу. (Возьмите города РБ, можно только областные).
'''

import re


def sity_search_index(index):
    sity_index = {
        "220000": "Минск",
        "210000": "Витебск",
        "246000": "Гомель",
        "224000": "Брест",
        "230000": "Гродно",
        "212000": "Могилев"
    }

    match = re.fullmatch(r"[2][1-4][0|2|4|6][0]{3}", index)
    if match:
        return sity_index[index]
    else:
        return f"Ваш индекс: {index} - не найден."


print(sity_search_index(index=input("Введи индекс обласного города РБ: ")))